package enums;

public enum Category {

    ЛюбаяКатегория("Любая категория"),
    Транспорт("ТРАНСПОРТ"),
    Автомобили("Автомобили"),
    МотоциклыИМототехника("Мотоциклы и мототехника"),
    ГрузовикиИСпецтехника("Грузовики и спецтехника"),
    ВодныйТранспорт("Водный транспорт"),
    ЗапчастиИАксессуары("Запчасти и аксессуары"),
    Недвижимость("НЕДВИЖИМОСТЬ"),
    Квартиры("Квартиры"),
    Комнаты("Комнаты"),
    ДомаДачиКоттеджи("Дома, дачи, коттеджи"),
    ГаражиИМашиноместа("Гаражи и машиноместа"),
    ЗемельныеУчастки("Земельные участки"),
    КоммерческаяНедвижимость("Коммерческая недвижимость"),
    НедвижимостьЗаРубежом("Недвижимость за рубежом"),
    Работа("РАБОТА"),
    Вакансии("Вакансии"),
    Резюме("Резюме"),
    Услуги("УСЛУГИ"),
    ЛичныеВещи("ЛИЧНЫЕ ВЕЩИ"),
    ОдеждаОбувьАксессуары("Одежда, обувь, аксессуары"),
    ДетскаОдеждаИОбувь("Детская одежда и обувь"),
    ТоварДляДетейИИгрушки("Товары для детей и игрушки"),
    ЧасыИУкрашения("Часы и украшения"),
    КрасотаИЗдоровье("Красота и здоровье"),
    ДляДомаИДачи("ДЛЯ ДОМА И ДАЧИ"),
    БытоваяТехника("Бытовая техника"),
    МебельИИнтерьер("Мебель и интерьер"),
    ПосудаИТоварыДляКухни("Посуда и товары для кухни"),
    ПродуктыПитания("Продукты питания"),
    РемонтИСтроительство("Ремонт и строительство"),
    Растения("Растения"),
    БытоваяЭлектроника("БЫТОВАЯ ЭЛЕКТРОНИКА"),
    АудиоИВидео("Аудио и видео"),
    ИгрыПриставкиИПрограммы("Игры, приставки и программы"),
    НастольныеКомпьютеры("Настольные компьютеры"),
    Ноутбуки("Ноутбуки"),
    ОргтехникаИРасходники("Оргтехника и расходники"),
    ПланшетыИЭлектронныеКниги("Планшеты и электронные книги"),
    Телефоны("Телефоны"),
    ТоварыДляКомпьютера("Товары для компьютера"),
    Фототехника("Фототехника"),
    ХоббиИОтдых("ХОББИ И ОТДЫХ"),
    БилетыИПутешествия("Билеты и путешествия"),
    Велосипеды("Велосипеды"),
    КнигиИЖурналы("Книги и журналы"),
    Коллекционирование("Коллекционирование"),
    МузыкальныеИнструменты("Музыкальные инструменты"),
    ОхотаИРыбалка("Охота и рыбалка"),
    СпортИОтдых("Спорт и отдых"),
    Животные("ЖИВОТНЫЕ"),
    Собаки("Собаки"),
    Кошки("Кошки"),
    Птицы("Птицы"),
    Аквариум("Аквариум"),
    ДругиеЖивотные("Другие животные"),
    ТоварыДляЖивотных("Товары для животных"),
    ГотовыйБизнесИОборудование("ГОТОВЫЙ БИЗНЕС И ОБОРУДОВАНИЕ"),
    ГотовыйБизнес("Готовый бизнес"),
    ОборудованиеДляБизнеса("Оборудование для бизнеса");

    public String value;

    public String getValue() {
        return value;
    }


    Category(String value) {
        this.value = value;
    }

}
