#language: ru
 @2

 Функционал: "Поиск на авито"

   Дано "Открыть браузер"

    Структура сценария: "Найдем самые дорогие принтеры на авито"
       Когда Открыт ресурс Авито
       И В выпадающем списке категорий выбрана
       И В поле поиска введено значение <StringForSearch>
       Тогда Кликнуть по выпадающему списку региона
       Тогда В поле регион ввести <city>
       И Нажата кнопка показать объявление
       Тогда Открылась страница результаты по запросу <StringForSearch>
       И Активирован чекбокс только с фотографией
       И В выпадающем списке сортировка выбрано значение
       И В консоль выведено значение название цены <quantity> первых товаров

       Примеры: :
         | StringForSearch | city        | quantity |
         | принтер         | Владивосток | 3        |
         | монитор         | Краснодар   | 6        |
