
 Feature: "Поиск на авито"

     Scenario Outline: "Найдем самые дорогие принтеры на авито"
       When Открыт ресурс Авито
       And В выпадающем списке категорий выбрана {category>}
       And В поле поиска введено значение <StringForSearch>
       Then Кликнуть по выпадающему списку региона
       Then В поле регион ввести <city>
       And Нажата кнопка показать объявление
       Then Открылась страница результаты по запросу <StringForSearch>
       And Активирован чекбокс только с фотографией
       And В выпадающем списке сортировка выбрано значение {sort}
       And В консоль выведено значение название цены <quantity> первых товаров

       Examples:
         | StringForSearch | city        | quantity |
         | принтер         | Владивосток | 3        |
         | монитор         | Краснодар   | 6        |
