package steps;

import io.cucumber.java.ru.Дано;
import io.cucumber.java.ru.И;
import io.cucumber.java.ru.Когда;
import io.cucumber.java.ru.Тогда;

public class MyStepdefs {

    @Дано("Открыть браузер")
    public void открытБраузер(){

    }

    @Когда("Открыт ресурс Авито")
    public void открытРесурсАвито() {
    }

    @И("В выпадающем списке категорий выбрана {category>}")
    public void вВыпадающемСпискеКатегорийВыбранаCategory( Category category) {
    }

    @И("В поле поиска введено значение <StringForSearch>")
    public void вПолеПоискаВведеноЗначениеStringForSearch() {
    }

    @Тогда("Кликнуть по выпадающему списку региона")
    public void кликнутьПоВыпадающемуСпискуРегиона() {
    }

    @Тогда("В поле регион ввести <city>")
    public void вПолеРегионВвестиCity() {
    }

    @И("Нажата кнопка показать объявление")
    public void нажатаКнопкаПоказатьОбъявление() {
    }

    @Тогда("Открылась страница результаты по запросу <StringForSearch>")
    public void открыласьСтраницаРезультатыПоЗапросуStringForSearch() {
    }

    @И("Активирован чекбокс только с фотографией")
    public void активированЧекбоксТолькоСФотографией() {
    }

    @И("В выпадающем списке сортировка выбрано значение {sort}")
    public void вВыпадающемСпискеСортировкаВыбраноЗначениеSort(Sort sort) {
    }

    @И("В консоль выведено значение название цены <quantity> первых товаров")
    public void вКонсольВыведеноЗначениеНазваниеЦеныQuantityПервыхТоваров() {
    }
}
